---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
source: html/12bfd240-202f-a99d-0a26-f16b38cdf60b.htm
---
# TriangulationInterfaceForTriangulatedShellComponent Properties

Specifies whether the .NET object represents a valid Revit entity.